{"class_name": "ANN_model", "backend": "tensorflow", "config": {"name": "ann_model_1", "layers": [{"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 64, "batch_input_shape": [null, 784], "use_bias": true, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 10, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "name": "dense_2", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "softmax"}}]}, "keras_version": "2.2.4"}